%% 半波长换能器设计（位移节点位于压电陶瓷内部）
clc;
clear;
% z = p*s*c;波阻抗
% k=W/C;波数
f = 30000; % 换能器频率
w = 2*pi*f; %圆频率
p2 = 7550;
p1 = 7850;
c2 = 3100;%压电陶瓷声速
c1 = 5170;%45钢波速 m/s
s1 = pi*0.03*0.03;%面积
s2 = pi*0.03*0.03-pi*0.01*0.01;
k1 = w/c1;
k2 = w/c2;

l1=0.01;%换能器后盖板

syms lc1
equ = tan(k2*lc1)-p2*c2*s2*cot(k1*l1)/(p1*c1*s1)==0
vpasolve(equ,lc1,0.015)
%% 换能器前盖板
clc;
clear;
% z = p*s*c;波阻抗
% k=W/C;波数
f = 30000; % 换能器频率
w = 2*pi*f; %圆频率
p2 = 7550;
p1 = 7850;
c2 = 3100;%压电陶瓷声速
c1 = 5170;%45钢波速 m/s
s1 = pi*0.03*0.03;%面积
s2 = pi*0.03*0.03-pi*0.01*0.01;
k1 = w/c1;
k2 = w/c2;

lc2=0.0147;%lc1=0.03-lc2
syms l2
equ2 = tan(k2*lc2)-p2*c2*s2*cot(k1*l2)/(p1*c1*s1) == 0
vpasolve(equ2,l2,0.01)